IDENTIFICATION DIVISION.
PROGRAM-ID. ACCOUNTS-RECEIVABLE-LISTING.
AUTHOR. KYLE T FOLEY.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.

FILE-CONTROL.

	SELECT IP-ACCTS-RECV-FILE
		ASSIGN TO IP-ACCTS-RECV-DISK
		ORGANIZATION IS SEQUENTIAL
		ACCESS IS SEQUENTIAL.
	
	SELECT OP-ACCTS-RECV-REPT
		ASSIGN TO OP-ACCTS-RECV-DISK.
	
DATA DIVISION.

FILE SECTION.

FD IP-ACCTS-RECV-FILE
	LABEL RECORDS ARE STANDARD
	RECORD CONTAINS 95 CHARACTERS
	DATA RECORD IS IP-ACCTS-RECV-REC.
	
01	IP-ACCTS-RECV-REC.
	05	IAR-CUSTOMER-ID.
		10	IAR-ID-NUMBER				PIC	 X(05).
		10	IAR-ID-NAME					PIC	 X(20).
	05	IAR-CUSTOMER-ADDRESS.
		10	IAR-STREET					PIC	 X(15).
		10	IAR-CITY					PIC	 X(15).
		10	IAR-STATE					PIC	 X(02).
		10	IAR-ZIP						PIC	 X(05).
	05	FILLER							PIC	 X(20).
	05	IAR-BALANCE.
		10	IAR-DATE.
			15	IAR-MONTH				PIC	 X(02).
			15	IAR-DAY					PIC	 X(02).
			15	IAR-YEAR				PIC	 X(02).
		10	IAR-ACCOUNT-BALANCE			PIC S9(05)V99.
		
FD OP-ACCTS-RECV-REPT
	LABEL RECORDS ARE OMITTED
	RECORD CONTAINS 132 CHARACTERS
	DATA RECORD IS OP-ACCTS-RECV-REC.
	
01 	OP-ACCTS-RECV-REC.
	05	OAR-CUSTOMER-ID.
		10	FILLER						PIC  X(05).
		10	OAR-ID-NUMBER				PIC  X(05).
		10	FILLER						PIC  X(02).
		10	OAR-ID-NAME					PIC  X(20).
	05	OAR-ADDRESS.
		10	FILLER						PIC  X(04).
		10	OAR-STREET					PIC  X(15).
		10	FILLER						PIC  X(04).
		10	OAR-CITY					PIC  X(15).
		10	FILLER						PIC  X(03).
		10	OAR-STATE					PIC  X(02).
		10	FILLER						PIC  X(03).
		10	OAR-ZIP						PIC  X(05).
	05	OAR-BALANCE.
		10	OAR-DATE.
			15	FILLER					PIC  X(04).
			15	OAR-MONTH				PIC  X(02)/.
			15	OAR-DAY					PIC  X(02)/.
			15	OAR-YEAR				PIC  X(02).
			15	FILLER					PIC  X(04).
		10	OAR-ACCOUNT-BALANCE			PIC ZZ,ZZ9.99DB.
	05	FILLER							PIC  X(22).

WORKING-STORAGE SECTION.

01	PROGRAM-SWITCHES.
	05	EOF-ACCTS-RECV-FILE-SW			PIC  X(03)	VALUE "NO".
	
01	ACCUMULATORS.
	05	A-TOTAL-ACCOUNT-BALANCE			PIC S9(6)V99 VALUE ZERO.
	
01	TITLE-1.
	05	FILLER					PIC  X(54)	VALUE " ".
	05	FILLER					PIC  X(04)	VALUE "LONG".
	05	FILLER					PIC  X(01)	VALUE " ".
	05	FILLER					PIC  X(10)	VALUE "HEADACHES".
	05	FILLER					PIC  X(01)	VALUE ",".
	05	FILLER					PIC  X(01)	VALUE " ".
	05	FILLER					PIC  X(09)	VALUE "UNLIMITED".
	05	FILLER					PIC  X(53)	VALUE " ".
	
01	HEADER-1.
	05	FILLER					PIC  X(04)	VALUE " ".
	05	FILLER					PIC  X(06)	VALUE "NUMBER".
	05	FILLER					PIC  X(02)	VALUE " ".
	05	FILLER					PIC  X(04)	VALUE "NAME".
	05	FILLER					PIC  X(20)	VALUE " ".
	05	FILLER					PIC  X(06)	VALUE "STREET".
	05	FILLER					PIC  X(13)	VALUE " ".
	05	FILLER					PIC  X(04)	VALUE "CITY".
	05	FILLER					PIC  X(12)	VALUE " ".
	05	FILLER					PIC  X(05)	VALUE "STATE".
	05	FILLER					PIC  X(03)	VALUE " ".
	05	FILLER					PIC  X(03)	VALUE "ZIP".
	05	FILLER					PIC  X(07)	VALUE " ".
	05	FILLER					PIC  X(04)	VALUE "DATE".
	05	FILLER					PIC  X(07)	VALUE " ".
	05	FILLER					PIC  X(07)	VALUE "BALANCE".
	05	FILLER					PIC  X(25)	VALUE " ".
	
01	HEADER-2.
	05	FILLER					PIC  X(04)	VALUE" ".
	05	FILLER					PIC  X(06)	VALUE ALL "-".
	05	FILLER					PIC  X(02)	VALUE " ".
	05	FILLER					PIC  X(20)	VALUE ALL "-".
	05	FILLER					PIC  X(04)	VALUE " ".
	05	FILLER					PIC  X(15)	VALUE ALL "-".
	05	FILLER					PIC  X(04)	VALUE " ".
	05	FILLER					PIC  X(15)	VALUE ALL "-".
	05	FILLER					PIC  X(01)	VALUE " ".
	05	FILLER					PIC  X(05)	VALUE ALL "-".
	05	FILLER					PIC  X(02)	VALUE " ".
	05	FILLER					PIC  X(05)	VALUE ALL "-".
	05	FILLER					PIC  X(04)	VALUE " ".
	05	FILLER					PIC  X(08)	VALUE ALL "-".
	05	FILLER					PIC  X(04)	VALUE " ".
	05	FILLER					PIC  X(09)	VALUE ALL "-".
	05	FILLER					PIC  X(24)	VALUE " ".
	
01	FOOTER-1.
	05	FILLER					PIC  X(98)	VALUE " ".
	05	FILLER					PIC  X(10)	VALUE ALL "-".
	05	FILLER					PIC  X(24)	VALUE " ".

01	GRAND-TOTAL-LINE.
	05	FILLER					PIC  X(98)	VALUE " ".
	05	GTL-ACCOUNT-BALANCE		PIC ZZZ,ZZ9.99DB.
	05	FILLER					PIC  X(22)	VALUE " ".
	
PROCEDURE DIVISION.

0000-MAINLINE.
	
	PERFORM A100-SETUP.
	PERFORM A200-PROCESS
		UNTIL EOF-ACCTS-RECV-FILE-SW IS EQUAL TO "YES".
	PERFORM A300-WRAPUP.
	STOP RUN.
	
A100-SETUP.

	OPEN INPUT IP-ACCTS-RECV-FILE
		OUTPUT OP-ACCTS-RECV-REPT.
		
	MOVE TITLE-1				TO OP-ACCTS-RECV-REC.
	WRITE OP-ACCTS-RECV-REC
		AFTER PAGE.
		
	MOVE HEADER-1				TO OP-ACCTS-RECV-REC.
	WRITE OP-ACCTS-RECV-REC
		AFTER ADVANCING 2.
		
	MOVE HEADER-2				TO OP-ACCTS-RECV-REC.
	WRITE OP-ACCTS-RECV-REC
		AFTER ADVANCING 1 LINE.
		
	MOVE SPACES					TO OP-ACCTS-RECV-REC.
	
	READ IP-ACCTS-RECV-FILE
		AT END MOVE "YES"		TO EOF-ACCTS-RECV-FILE-SW.
		
		
A200-PROCESS.
	
	MOVE IAR-ID-NUMBER			TO OAR-ID-NUMBER.
	MOVE IAR-ID-NAME			TO OAR-ID-NAME.
	MOVE IAR-STREET				TO OAR-STREET.
	MOVE IAR-CITY				TO OAR-CITY.
	MOVE IAR-STATE				TO OAR-STATE.
	MOVE IAR-ZIP				TO OAR-ZIP.
	MOVE IAR-MONTH				TO OAR-MONTH.
	MOVE IAR-DAY				TO OAR-DAY.
	MOVE IAR-YEAR				TO OAR-YEAR.
	MOVE IAR-ACCOUNT-BALANCE	TO OAR-ACCOUNT-BALANCE.
	
	WRITE OP-ACCTS-RECV-REC
		AFTER ADVANCING 2 LINES.
		
	ADD IAR-ACCOUNT-BALANCE		TO A-TOTAL-ACCOUNT-BALANCE.
	
	READ IP-ACCTS-RECV-FILE
		AT END MOVE "YES"		TO EOF-ACCTS-RECV-FILE-SW.
		
		
A300-WRAPUP.

	MOVE FOOTER-1				TO OP-ACCTS-RECV-REC.
	WRITE OP-ACCTS-RECV-REC
		AFTER ADVANCIN 1 LINE.
		
	MOVE A-TOTAL-ACCOUNT-BALANCE TO GTL-ACCOUNT-BALANCE.
	MOVE GRAND-TOTAL-LINE		TO OP-ACCTS-RECV-REC.
	WRITE OP-ACCTS-RECV-REC
		AFTER ADVANCING 1 LINE.
	
	CLOSE IP-ACCTS-RECV-FILE
		OP-ACCTS-RECV-REPT.